Repository: AshwinKumarBV-git/Virtual_Labs
Catalog: stem_app/frontend/lib/l10n/app_*.arb
Languages: hi, kn

# appTitle
source: RuralSTEM Labs
hi: स्टेम लर्निंग ऐप
kn: ಸ್ಟೆಮ್ ಲರ್ನಿಂಗ್ ಅಪ್ಲಿಕೇಶನ್

# homeVirtualLabsButton
source: Virtual Labs
hi: वर्चुअल लैब्स
kn: ವರ್ಚುವಲ್ ಲ್ಯಾಬ್‌ಗಳು

# homeImageExplanationButton
source: Explain Image
hi: छवि समझाएं
kn: ಚಿತ್ರವನ್ನು ವಿವರಿಸಿ

# labSelectionTitle
source: Select a Lab
hi: एक लैब चुनें
kn: ಒಂದು ಲ್ಯಾಬ್ ಆಯ್ಕೆಮಾಡಿ

# labDensityTitle
source: Measuring Density
hi: घनत्व मापना
kn: ಸಾಂದ್ರತೆಯನ್ನು ಅಳೆಯುವುದು

# labSoilPhTitle
source: Testing Soil pH
hi: मिट्टी का पीएच परीक्षण
kn: ಮಣ್ಣಿನ pH ಪರೀಕ್ಷೆ

# labOsmosisTitle
source: Observing Osmosis
hi: परासरण का निरीक्षण
kn: ಆಸ್ಮೋಸಿಸ್ ಅನ್ನು ಗಮನಿಸುವುದು

# labQuizButton
source: Take Quiz
hi: क्विज लें
kn: ರಸಪ್ರಶ್ನೆ ತೆಗೆದುಕೊಳ್ಳಿ

# soilPhSelectHint
source: Select Soil Type
hi: मिट्टी का प्रकार चुनें
kn: ಮಣ್ಣಿನ ಪ್ರಕಾರವನ್ನು ಆಯ್ಕೆಮಾಡಿ

# soilTypeAcidic
source: Acidic Soil (e.g., Clay)
hi: अम्लीय मिट्टी (जैसे, चिकनी मिट्टी)
kn: ಆಮ್ಲೀಯ ಮಣ್ಣು (ಉದಾ., ಜೇಡಿಮಣ್ಣು)

# soilTypeNeutral
source: Neutral Soil (e.g., Loam)
hi: तटस्थ मिट्टी (जैसे, दोमट)
kn: ತಟಸ್ಥ ಮಣ್ಣು (ಉದಾ., ಲೋಮ್)

# soilTypeBasic
source: Basic/Alkaline Soil (e.g., Chalky)
hi: क्षारीय मिट्टी (जैसे, खड़िया)
kn: ಕ್ಷಾರೀಯ ಮಣ್ಣು (ಉದಾ., ಸೀಮೆಸುಣ್ಣ)

# soilPhExplanationAcidic
source: The natural indicator (like turmeric) turns yellow/remains yellow in acidic soil. Many plants struggle in highly acidic soil; adding lime can help raise the pH.
hi: प्राकृतिक संकेतक (जैसे हल्दी) अम्लीय मिट्टी में पीला हो जाता है / पीला रहता है। कई पौधे अत्यधिक अम्लीय मिट्टी में संघर्ष करते हैं; चूना मिलाने से पीएच बढ़ाने में मदद मिल सकती है।
kn: ನೈಸರ್ಗಿಕ ಸೂಚಕ (ಅರಿಶಿನದಂತಹ) ಆಮ್ಲೀಯ ಮಣ್ಣಿನಲ್ಲಿ ಹಳದಿ ಬಣ್ಣಕ್ಕೆ ತಿರುಗುತ್ತದೆ / ಹಳದಿಯಾಗಿರುತ್ತದೆ. ಹೆಚ್ಚು ಆಮ್ಲೀಯ ಮಣ್ಣಿನಲ್ಲಿ ಅನೇಕ ಸಸ್ಯಗಳು ಬೆಳೆಯಲು ಕಷ್ಟಪಡುತ್ತವೆ; ಸುಣ್ಣವನ್ನು ಸೇರಿಸುವುದರಿಂದ pH ಹೆಚ್ಚಿಸಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ.

# soilPhExplanationNeutral
source: The natural indicator turns yellow/remains yellow in neutral soil. Most common plants thrive in neutral pH (around 6.5-7.0).
hi: प्राकृतिक संकेतक तटस्थ मिट्टी में पीला हो जाता है / पीला रहता है। अधिकांश सामान्य पौधे तटस्थ पीएच (लगभग 6.5-7.0) में पनपते हैं।
kn: ನೈಸರ್ಗಿಕ ಸೂಚಕ ತಟಸ್ಥ ಮಣ್ಣಿನಲ್ಲಿ ಹಳದಿ ಬಣ್ಣಕ್ಕೆ ತಿರುಗುತ್ತದೆ / ಹಳದಿಯಾಗಿರುತ್ತದೆ. ಹೆಚ್ಚಿನ ಸಾಮಾನ್ಯ ಸಸ್ಯಗಳು ತಟಸ್ಥ pH (ಸುಮಾರು 6.5-7.0) ನಲ್ಲಿ ಚೆನ್ನಾಗಿ ಬೆಳೆಯುತ್ತವೆ.

# soilPhExplanationBasic
source: The natural indicator turns reddish-brown/red in basic (alkaline) soil. Some plants prefer alkaline conditions, but high alkalinity can limit nutrient availability for others. Adding organic matter can help lower pH.
hi: प्राकृतिक संकेतक क्षारीय मिट्टी में लाल-भूरा/लाल हो जाता है। कुछ पौधे क्षारीय स्थितियों को पसंद करते हैं, लेकिन उच्च क्षारीयता दूसरों के लिए पोषक तत्वों की उपलब्धता को सीमित कर सकती है। कार्बनिक पदार्थ मिलाने से पीएच कम करने में मदद मिल सकती है।
kn: ನೈಸರ್ಗಿಕ ಸೂಚಕ ಕ್ಷಾರೀಯ ಮಣ್ಣಿನಲ್ಲಿ ಕೆಂಪು-ಕಂದು/ಕೆಂಪು ಬಣ್ಣಕ್ಕೆ ತಿರುಗುತ್ತದೆ. ಕೆಲವು ಸಸ್ಯಗಳು ಕ್ಷಾರೀಯ ಪರಿಸ್ಥಿತಿಗಳನ್ನು ಆದ್ಯತೆ ನೀಡುತ್ತವೆ, ಆದರೆ ಹೆಚ್ಚಿನ ಕ್ಷಾರೀಯತೆಯು ಇತರರಿಗೆ ಪೋಷಕಾಂಶಗಳ ಲಭ್ಯತೆಯನ್ನು ಸೀಮಿತಗೊಳಿಸಬಹುದು. ಸಾವಯವ ಪದಾರ್ಥವನ್ನು ಸೇರಿಸುವುದರಿಂದ pH ಕಡಿಮೆ ಮಾಡಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ.

# osmosisSelectHint
source: Select Solution
hi: घोल चुनें
kn: ದ್ರಾವಣವನ್ನು ಆಯ್ಕೆಮಾಡಿ

# solutionWater
source: Plain Water
hi: सादा पानी
kn: ಸರಳ ನೀರು

# solutionSaltwater
source: Salt Water
hi: नमक का पानी
kn: ಉಪ್ಪು ನೀರು

# osmosisExplanationWater
source: In plain water, the water concentration outside the potato cells is higher than inside. Water moves into the cells via osmosis, causing the potato slice to become slightly larger and firmer (turgid).
hi: सादे पानी में, आलू की कोशिकाओं के बाहर पानी की सांद्रता अंदर से अधिक होती है। परासरण के माध्यम से पानी कोशिकाओं में प्रवेश करता है, जिससे आलू का टुकड़ा थोड़ा बड़ा और सख्त (स्फीत) हो जाता है।
kn: ಸರಳ ನೀರಿನಲ್ಲಿ, ಆಲೂಗಡ್ಡೆ ಕೋಶಗಳ ಹೊರಗಿನ ನೀರಿನ ಸಾಂದ್ರತೆಯು ಒಳಗಿನದಕ್ಕಿಂತ ಹೆಚ್ಚಾಗಿರುತ್ತದೆ. ಆಸ್ಮೋಸಿಸ್ ಮೂಲಕ ನೀರು ಕೋಶಗಳೊಳಗೆ ಚಲಿಸುತ್ತದೆ, ಇದರಿಂದಾಗಿ ಆಲೂಗಡ್ಡೆ ತುಂಡು ಸ್ವಲ್ಪ ದೊಡ್ಡದಾಗಿ ಮತ್ತು ಗಟ್ಟಿಯಾಗುತ್ತದೆ (ಟರ್ಜಿಡ್).

# osmosisExplanationSaltwater
source: In salt water, the water concentration outside the potato cells is lower than inside (due to dissolved salt). Water moves out of the cells via osmosis, causing the potato slice to shrink and become limp (flaccid).
hi: नमक के पानी में, आलू की कोशिकाओं के बाहर पानी की सांद्रता अंदर से कम होती है (घुलित नमक के कारण)। परासरण के माध्यम से पानी कोशिकाओं से बाहर निकलता है, जिससे आलू का टुकड़ा सिकुड़ जाता है और ढीला (श्लथ) हो जाता है।
kn: ಉಪ್ಪು ನೀರಿನಲ್ಲಿ, ಆಲೂಗಡ್ಡೆ ಕೋಶಗಳ ಹೊರಗಿನ ನೀರಿನ ಸಾಂದ್ರತೆಯು ಒಳಗಿನದಕ್ಕಿಂತ ಕಡಿಮೆಯಿರುತ್ತದೆ (ಕರಗಿದ ಉಪ್ಪಿನ ಕಾರಣ). ಆಸ್ಮೋಸಿಸ್ ಮೂಲಕ ನೀರು ಕೋಶಗಳಿಂದ ಹೊರಗೆ ಚಲಿಸುತ್ತದೆ, ಇದರಿಂದಾಗಿ ಆಲೂಗಡ್ಡೆ ತುಂಡು ಕುಗ್ಗುತ್ತದೆ ಮತ್ತು ಮೃದುವಾಗುತ್ತದೆ (ಫ್ಲಾಸಿಡ್).

# quizNextButton
source: Next
hi: अगला
kn: ಮುಂದೆ

# quizSubmitButton
source: Submit
hi: जमा करें
kn: ಸಲ್ಲಿಸಿ

# quizBackButton
source: Back to Labs
hi: लैब्स पर वापस जाएं
kn: ಲ್ಯಾಬ್‌ಗಳಿಗೆ ಹಿಂತಿರುಗಿ

# quizScoreFeedback
source: You scored {score} out of {total}
hi: आपने {total} में से {score} अंक प्राप्त किए
kn: ನೀವು {total} ರಲ್ಲಿ {score} ಅಂಕಗಳನ್ನು ಗಳಿಸಿದ್ದೀರಿ

# quizSelectAnswerPrompt
source: Please select an answer.
hi: कृपया एक उत्तर चुनें।
kn: ದಯವಿಟ್ಟು ಉತ್ತರವನ್ನು ಆಯ್ಕೆಮಾಡಿ.

# imageExplanationTitle
source: Explain Image
hi: छवि समझाएं
kn: ಚಿತ್ರವನ್ನು ವಿವರಿಸಿ

# selectLanguage
source: Select Explanation Language:
hi: स्पष्टीकरण भाषा चुनें:
kn: ವಿವರಣೆ ಭಾಷೆಯನ್ನು ಆಯ್ಕೆಮಾಡಿ:

# languageHindi
source: Hindi
hi: हिन्दी
kn: ಹಿಂದಿ

# languageKannada
source: Kannada
hi: कन्नड़
kn: ಕನ್ನಡ

# captureImageButton
source: Capture Image
hi: छवि कैप्चर करें
kn: ಚಿತ್ರವನ್ನು ಸೆರೆಹಿಡಿಯಿರಿ

# uploadImageButton
source: Upload Image
hi: छवि अपलोड करें
kn: ಚಿತ್ರವನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಿ

# getExplanationButton
source: Get Explanation
hi: स्पष्टीकरण प्राप्त करें
kn: ವಿವರಣೆಯನ್ನು ಪಡೆಯಿರಿ

# explanationLoading
source: Getting explanation...
hi: स्पष्टीकरण प्राप्त हो रहा है...
kn: ವಿವರಣೆಯನ್ನು ಪಡೆಯಲಾಗುತ್ತಿದೆ...

# explanationError
source: Error getting explanation. Please try again.
hi: स्पष्टीकरण प्राप्त करने में त्रुटि। कृपया पुन: प्रयास करें।
kn: ವಿವರಣೆಯನ್ನು ಪಡೆಯುವಲ್ಲಿ ದೋಷ. ದಯವಿಟ್ಟು ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ.

# noImageSelected
source: Please select an image first.
hi: कृपया पहले एक छवि चुनें।
kn: ದಯವಿಟ್ಟು ಮೊದಲು ಚಿತ್ರವನ್ನು ಆಯ್ಕೆಮಾಡಿ.

# speakExplanationButtonLabel
source: Speak explanation
hi: स्पष्टीकरण बोलें
kn: ವಿವರಣೆಯನ್ನು ಮಾತನಾಡಿ

# offlineWarning
source: Network error. Please check connection.
hi: नेटवर्क त्रुटि। कृपया कनेक्शन जांचें।
kn: ನೆಟ್‌ವರ್ಕ್ ದೋಷ. ದಯವಿಟ್ಟು ಸಂಪರ್ಕವನ್ನು ಪರಿಶೀಲಿಸಿ.

# retryButtonLabel
source: Retry
hi: पुनः प्रयास करें
kn: ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ
